In [1]:
import pandas as pd
#Write your code in one or more cells (please remove this line from your notebook)
from sqlalchemy import create_engine
engine_string = ""
engine = create_engine("postgresql+psycopg2://postgres:password@jrvs-psql:5432/exercises")
bookings_df = pd.read_sql('Select * from cd.bookings',engine)
members_df = pd.read_sql('Select * from cd.members',engine)
facilities_df = pd.read_sql('Select * from cd.facilities',engine)
members_df.head()

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,NaN,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,NaN,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,NaN,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1.0,2012-07-03 10:25:05

In [2]:
result = pd.merge(members_df, bookings_df, how="inner", on=["memid"])
result = result[(result['firstname'] == "David") & (result['surname'] == "Farrell")]
st= result['starttime'].reset_index()
print(st)

    index           starttime
0    3915 2012-09-18 09:00:00
1    3916 2012-09-18 17:30:00
2    3917 2012-09-18 13:30:00
3    3918 2012-09-18 20:00:00
4    3919 2012-09-19 09:30:00
5    3920 2012-09-19 15:00:00
6    3921 2012-09-19 12:00:00
7    3922 2012-09-20 15:30:00
8    3923 2012-09-20 11:30:00
9    3924 2012-09-20 14:00:00
10   3925 2012-09-21 10:30:00
11   3926 2012-09-21 14:00:00
12   3927 2012-09-22 08:30:00
13   3928 2012-09-22 17:00:00
14   3929 2012-09-23 08:30:00
15   3930 2012-09-23 17:30:00
16   3931 2012-09-23 19:00:00
17   3932 2012-09-24 08:00:00
18   3933 2012-09-24 16:30:00
19   3934 2012-09-24 12:30:00
20   3935 2012-09-25 15:30:00
21   3936 2012-09-25 17:00:00
22   3937 2012-09-26 13:00:00
23   3938 2012-09-26 17:00:00
24   3939 2012-09-27 08:00:00
25   3940 2012-09-28 11:30:00
26   3941 2012-09-28 09:30:00
27   3942 2012-09-28 13:00:00
28   3943 2012-09-29 16:00:00
29   3944 2012-09-29 10:30:00
30   3945 2012-09-29 13:30:00
31   3946 2012-09-29 14:30:00
32   3947 2012-09-29 17:30:00
33   3948 2012-09-30 14:30:00

In [3]:
result = pd.merge(bookings_df, facilities_df,how='inner',on='facid')
result= result[(result['name'].isin(['Tennis Court 1','Tennis Court 2'])) & (result['starttime']>='2012-09-21') & (result['starttime']<'2012-09-22')]
stt=result[['starttime','name']].sort_values(by='starttime').reset_index(drop=True)
print(stt)

             starttime            name
0  2012-09-21 08:00:00  Tennis Court 1
1  2012-09-21 08:00:00  Tennis Court 2
2  2012-09-21 09:30:00  Tennis Court 1
3  2012-09-21 10:00:00  Tennis Court 2
4  2012-09-21 11:30:00  Tennis Court 2
5  2012-09-21 12:00:00  Tennis Court 1
6  2012-09-21 13:30:00  Tennis Court 1
7  2012-09-21 14:00:00  Tennis Court 2
8  2012-09-21 15:30:00  Tennis Court 1
9  2012-09-21 16:00:00  Tennis Court 2
10 2012-09-21 17:00:00  Tennis Court 1
11 2012-09-21 18:00:00  Tennis Court 2

In [4]:
result= members_df[members_df['recommendedby'].notnull()].groupby('recommendedby').size().reset_index(name='count').sort_values('recommendedby')

print(result)

    recommendedby  count
0             1.0      5
1             2.0      3
2             3.0      1
3             4.0      2
4             5.0      1
5             6.0      1
6             9.0      2
7            11.0      1
8            13.0      2
9            15.0      1
10           16.0      1
11           20.0      1
12           30.0      1

In [5]:
df=bookings_df[(bookings_df['facid']).notnull()].groupby('facid')['slots'].sum().reset_index(name='total slots').sort_values('facid')
display(df)

   facid  total slots
0      0         1320
1      1         1278
2      2         1209
3      3          830
4      4         1404
5      5          228
6      6         1104
7      7          908
8      8          911

In [6]:
df=bookings_df[(bookings_df['starttime']>= '2012-09-01') & (bookings_df['starttime'] <='2012-10-01')]
df= df[(bookings_df['facid']).notnull()].groupby('facid')['slots'].sum().reset_index(name='total sales').sort_values('total sales')
display(df)

<ipython-input-6-b4b684b00797>:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df= df[(bookings_df['facid']).notnull()].groupby('facid')['slots'].sum().reset_index(name='total sales').sort_values('total sales')

   facid  total sales
5      5          122
3      3          422
7      7          426
8      8          471
6      6          540
2      2          570
1      1          588
0      0          591
4      4          648

In [7]:
df = bookings_df[bookings_df['starttime'].dt.year == 2012].groupby(['facid', bookings_df['starttime'].dt.month])['slots'].sum().reset_index()
df.columns = ['facid', 'month', 'Total Slots']
df = df.sort_values(['facid', 'month'])

print(df)

    facid  month  Total Slots
0       0      7          270
1       0      8          459
2       0      9          591
3       1      7          207
4       1      8          483
5       1      9          588
6       2      7          180
7       2      8          459
8       2      9          570
9       3      7          104
10      3      8          304
11      3      9          422
12      4      7          264
13      4      8          492
14      4      9          648
15      5      7           24
16      5      8           82
17      5      9          122
18      6      7          164
19      6      8          400
20      6      9          540
21      7      7          156
22      7      8          326
23      7      9          426
24      8      7          117
25      8      8          322
26      8      9          471

In [8]:
df=bookings_df['memid'].nunique()
print(df)

30

In [9]:
booking = bookings_df[bookings_df['starttime'] > '01-09-2012']
df1 = pd.merge(members_df,booking, how='inner', on='memid').groupby(['memid', 'firstname', 'surname']).agg({'starttime': min})
df2=df1.sort_values('memid')

print(df2)

                                            starttime
memid firstname surname
0     GUEST     GUEST             2012-07-03 18:00:00
1     Darren    Smith             2012-07-03 08:00:00
2     Tracy     Smith             2012-07-04 09:00:00
3     Tim       Rownam            2012-07-04 13:30:00
4     Janice    Joplette          2012-07-10 08:30:00
5     Gerald    Butters           2012-07-16 11:00:00
6     Burton    Tracy             2012-07-26 09:00:00
7     Nancy     Dare              2012-07-26 09:30:00
8     Tim       Boothe            2012-07-26 08:00:00
9     Ponder    Stibbons          2012-08-04 09:30:00
10    Charles   Owen              2012-08-07 09:00:00
11    David     Jones             2012-08-11 08:00:00
12    Anne      Baker             2012-08-11 16:30:00
13    Jemima    Farrell           2012-08-11 08:00:00
14    Jack      Smith             2012-08-11 11:00:00
15    Florence  Bader             2012-08-16 14:30:00
16    Timothy   Baker             2012-08-17 08:30:00
17    David     Pinker            2012-08-20 12:30:00
20    Matthew   Genting           2012-08-27 09:00:00
21    Anna      Mackenzie         2012-08-30 10:00:00
22    Joan      Coplin            2012-09-02 11:30:00
24    Ramnaresh Sarwin            2012-09-04 11:00:00
26    Douglas   Jones             2012-09-08 13:00:00
27    Henrietta Rumney            2012-09-16 13:30:00
28    David     Farrell           2012-09-18 09:00:00
29    Henry     Worthington-Smyth 2012-09-19 09:30:00
30    Millicent Purview           2012-09-19 11:30:00
33    Hyacinth  Tupperware        2012-09-20 08:00:00
35    John      Hunt              2012-09-23 14:00:00
36    Erica     Crumpet           2012-09-27 11:30:00

In [10]:
result['name']=members_df['firstname'].str.cat(members_df['surname'],sep=' ')
res= result['name']
print(res)

0         GUEST GUEST
1        Darren Smith
2         Tracy Smith
3          Tim Rownam
4     Janice Joplette
5      Gerald Butters
6        Burton Tracy
7          Nancy Dare
8          Tim Boothe
9     Ponder Stibbons
10       Charles Owen
11        David Jones
12         Anne Baker
Name: name, dtype: object

In [11]:
filtered_fac= facilities_df[facilities_df['name'].str.startswith('Tennis')]

print(filtered_fac)

   facid            name  membercost  guestcost  initialoutlay  \
0      0  Tennis Court 1         5.0       25.0        10000.0
1      1  Tennis Court 2         5.0       25.0         8000.0

   monthlymaintenance
0               200.0
1               200.0

In [22]:
new = members_df[['memid','telephone']]
new= new[new['telephone'].str.contains('[()]')]
re= new.sort_values('memid')

                                  
print(re)

    memid       telephone
0       0  (000) 000-0000
3       3  (844) 693-0723
4       4  (833) 942-4710
5       5  (844) 078-4130
6       6  (822) 354-9973
7       7  (833) 776-4001
8       8  (811) 433-2547
9       9  (833) 160-3900
10     10  (855) 542-5251
11     11  (844) 536-8036
13     13  (855) 016-0163
14     14  (822) 163-3254
15     15  (833) 499-3527
18     20  (811) 972-1377
19     21  (822) 661-2898
20     22  (822) 499-2232
21     24  (822) 413-1470
23     27  (822) 989-8876
24     28  (855) 755-9876
25     29  (855) 894-3758
26     30  (855) 941-9786
27     33  (822) 665-5327
28     35  (899) 720-6978
29     36  (811) 732-4816
30     37  (822) 577-3541

In [24]:
# Create a new column 'letter' containing the first letter of the surname
members_df['letter'] = members_df['surname'].str[0]

# Group by 'letter' and calculate the count
counts = members_df['letter'].value_counts().reset_index()

# Rename the columns
counts.columns = ['letter', 'count']

# Sort the counts by 'letter'
sorted_counts = counts.sort_values('letter')

# Print the counts for each letter, skipping those with count 0
sorted_counts = sorted_counts[sorted_counts['count'] > 0]
print(sorted_counts.to_string(index=False))

letter  count
     B      5
     C      2
     D      1
     F      2
     G      2
     H      1
     J      3
     M      1
     O      1
     P      2
     R      2
     S      6
     T      2
     W      1